app/controllers/places_controller.rb

	def show
		@place = Place.find_by(:id => params["id"])
---
SELECT  "places".* FROM "places"  WHERE "places"."id" = 12 LIMIT 1

	def delete
		@place = Place.find_by(:id => params["id"])
		@place.delete
---
SELECT  "places".* FROM "places"  WHERE "places"."id" = 12 LIMIT 1
DELETE FROM "places" WHERE "places"."id" = 12